import type { Film } from '@/entities/film';

// 포스터 이미지
import KR from '@/shared/assets/images/film/killing-romance.webp';
import LC from '@/shared/assets/images/film/link-click.jpeg';
import GG from '@/shared/assets/images/film/gone-girl.webp';
import CS from '@/shared/assets/images/film/castle-in-the-sky.webp';
import US from '@/shared/assets/images/film/unbelivable-space-love.webp';
import CW from '@/shared/assets/images/film/cob-web.webp';

export const films4: Film[] = [
  {
    poster: KR,
    title: '킬링 로맨스 (2023)',
    description: `
	대재앙 같은 발연기로 국민 조롱거리로 전락한 톱스타 ‘여래’(이하늬).
	현실에서 벗어나고자 떠난 남태평양 ‘콸라’섬에서 운명처럼 자신을 구해준
	재벌 ‘조나단’(이선균)을 만나 결혼을 하고 새로운 인생을 꿈꾸며 돌연 은퇴를 선언한다.
	
	한편, 서울대가 당연한 집안에서 홀로 고독한 입시 싸움 중인 4수생 ‘범우’(공명)는
	한때 자신의 최애였던 여래가 옆집에 이사온 것을 알게 되고
	날마다 옥상에서 단독 팬미팅(?)을 여는 호사를 누린다.
	
	그러던 어느 날 조나단의 사업 확장을 위한 인형 역할에 지친
	여래는 완벽한 스크린 컴백을 위해 범우에게 SOS를 보내게 되고
	이들은 여래의 인생을 되찾기 위한 죽여주는 계획을 함께 모의하는데…`,
  },
  {
    poster: LC,
    title: '시광대리인时光代理人-LINK CLICK-',
    description: `번화가의 일각에 서 있는 「시광 사진관」.
	그 쓸쓸한 문 안쪽에는 특수한 능력을 가진 두 남자가 있었다.
	
	사진관을 운영하는 곳은 (토키)와 (히카루)가 있다.
	토키의 소꿉친구 (린)을 통해 고객의 날아드는 의뢰를 수행하기 위해
	「촬영자의 의식에 링크 해, 사진의 세계에 들어갈 수 있는 능력」을 가지는 토키와,
	「그 사진의 촬영 후 12시간의 사건을 파악할 수 있는 능력」을 가진 히카루는 콤비를 이루어,
	과거를 질질 끄는 클라이언트의 의뢰를 해결해 나간다.
	
	"절대로 과거의 개변을 해서는 안 된다"라는 규칙 아래 의뢰를 수행하고 있던 두 명이지만,
	정의감이 강한 토키는 과거에 간섭해 버리고,
	그 행동은 이윽고 조금씩 미래를 바꾸어 간다.`,
  },
  {
    poster: GG,
    title: '나를 찾아줘Gone Girl (2014)',
    description: `우리 부부는 누구나 부러워하는 '완벽한 커플'이었다.
	그날, 아내가 사라지기 전까지…
	
	모두가 부러워하는 삶을 살아가는 완벽한 커플 닉&에이미.
	결혼 5주년 기념일 아침, 에이미가 흔적도 없이 실종된다.
	유년시절 어린이 동화시리즈 '어메이징 에이미'의 실제 여주인공이었던
	유명인사 아내가 사라지자, 세상은 그녀의 실종사건으로 떠들썩해진다.
	
	한편 경찰은, 에이미가 결혼기념일 선물로 숨겨뒀던 편지와 함께
	곳곳에서 드러나는 단서들로 남편 닉을 유력한 용의자로 지목한다.
	미디어들이 살인 용의자 닉의 일거수일투족을 보도하기 시작하고,
	시간이 갈수록 세상의 관심이 그에게 더욱 집중된다.
	
	과연 닉은 아내를 죽였을까? 진실은 무엇일까?`,
  },
  {
    poster: CS,
    title: '천공의 성 라퓨타天てん空くうの城しろラピュタ (1986)',
    description:
      '광산촌 슬랙 계곡에서 기계 견습공으로 밝게 살고 있던 고아 소년 파즈는 어느날 빛이 나는 목걸이를 한 채 하늘에서 떨어지는 한 소녀(시타)를 구해준다. 소녀는 집안 대대로 전해져 오던 목걸이(비행석)로 인해 정부의 군대(무스카 일행)와 해적(도라 일당)들에게 쫓기고 있던 신세. 시타가 이들로부터 무사히 도망갈 수 있게 도와주던 중 파즈는 비행석과 하늘에 떠 있는 성 "라퓨타"가 실제로 존재한다는 사실을 알게 된다. 돌아가신 아버지의 영향으로 라퓨타의 존재를 믿고 있던 파즈는 시타와 함께 라퓨타를 찾기로 결심한다. 하지만 파즈와 시타는 그들을 쫓던 군대에게 잡히고, 시타는 정부 비밀 조사관인 무스카에게 파즈를 풀어주는 조건으로 협력을 약속한다. 군대에서 풀려난 파즈는 시타를 구하기 위해 도라 일당에 들어가고, 그들과 함께 시타를 구해온다. 그러나 시타로 인해 봉인이 풀려 라퓨타의 위치를 가리키게 된 목걸이(비행석)는 무스카에게 빼앗기고 만다. 군대와 무스카는 거대한 비행선 골리앗을 타고 라퓨타를 찾아 나서고, 그 뒤를 쫓아 파즈와 시타도 도라 일당과 함께 라퓨타를 찾아 나선다. 갑자기 닥친 악천후와 골리앗의 공격으로 도라 일당과 헤어진 파즈와 시타는 우연히 라퓨타에 도착, 라퓨타의 아름다운 정원에 감탄한다. 그러나 그것도 잠시... 도라 일당을 생포한 군대와 무스카 일행도 라퓨타에 도착했다는 사실을 알게 된다. 라퓨타에 도착한 군대는 온갖 파괴행위와 보물을 모으는 데만 급급해 하고, 그 틈을 이용해 무스카는 시타를 잡아 라퓨타 내부로 사라진다. 파즈는 잡혀 있던 도라 일당을 구해주고, 시타를 구하기 위해 무스카를 뒤쫓는다. 시타와 함께 라퓨타 내부의 거대한 비행석이 있는 중추에 다다른 무스카는 시타에게 자신 또한 라퓨타 왕가의 일족이였음을 밝힌다. 그 옛날 지상으로 내려 온 라퓨타 왕가는 시타와 무스카의 일족, 이렇게 두 갈래로 나눠졌던 것. 무스카는 과거 라퓨타의 힘을 부활시킴으로 세계를 지배하고자 한다. 무스카의 수중에 넘어간 라퓨타로 인해 끔찍한 살상이 자행되자 시타는 파즈와 함께 할머니로부터 배운 파멸의 주문을 외운다.',
  },
  {
    poster: US,
    title: '언빌리버블 스페이스 러브',
    description: `꿈 속, 낯선 사람과의 로맨스라는 주제로 진행되는 이야기다. 붉은 머리 테르는 눈을 떠보니 넓게 펼쳐진 바다의 모래사장 위였고 거기서 푸른 머리 사이오를 만난다. 테르는 이해가 가지 않는 상황에 "이건 꿈인가요?"라고 묻고 사이오는 "네"라고 답한다. 그러고선 사이오가 당신과 나는 연인 사이였고 처음 만났을 때부터 지금까지의 이야기를 들려준다. 사실…`,
  },
  {
    poster: CW,
    title: '거미집Cobweb (2023)',
    description: `“결말만 바꾸면 걸작이 된다, 딱 이틀이면 돼!”

	1970년대 꿈도 예술도 검열당하던 시대
	성공적이었던 데뷔작 이후, 악평과 조롱에 시달리던 김감독(송강호)은
	촬영이 끝난 영화 ‘거미집’의 새로운 결말에 대한 영감을 주는 꿈을 며칠째 꾸고 있다.
	그대로만 찍으면 틀림없이 걸작이 된다는 예감, 그는 딱 이틀 간의 추가 촬영을 꿈꾼다.
	그러나 대본은 심의에 걸리고, 제작자 백회장(장영남)은 촬영을 반대한다.
	제작사 후계자인 신미도(전여빈)를 설득한 김감독은 베테랑 배우 이민자(임수정), 톱스타 강호세(오정세), 떠오르는 스타 한유림(정수정)까지 불러 모아 촬영을 강행하지만, 스케줄 꼬인 배우들은 불만투성이다.
	설상가상 출장 갔던 제작자와 검열 담당자까지 들이닥치면서 현장은 아수라장이 되는데…
	
	과연 ‘거미집’은 세기의 걸작으로 완성될 수 있을까?`,
  },
];
